#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_secretsmanager_secret.github_token: Reading...
aws_cloudwatch_log_group.redis_cache_log_group: Refreshing state... [id=/cache/redis]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
aws_cloudwatch_log_group.bff_service_log_group: Refreshing state... [id=/ecs/bff-service]
aws_codestarconnections_connection.github_connection: Refreshing state... [id=arn:aws:codestar-connections:eu-west-1:802288441694:connection/1b430daa-4436-49d6-a3a6-bd27b73947db]
data.aws_availability_zones.available: Reading...
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_iam_role.codedeploy_role: Refreshing state... [id=codedeploy-role]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster]
data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
aws_iam_role.codebuild_role: Refreshing state... [id=codebuild-role]
data.aws_secretsmanager_secret.github_token: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
aws_iam_role.codepipeline_role: Refreshing state... [id=codepipeline-role]
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_cloudwatch_log_group.gtw_service_log_group: Refreshing state... [id=/ecs/gtw-service]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240819081518024600000002]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240819081517975400000001]
aws_iam_role_policy_attachment.codedeploy_attach: Refreshing state... [id=codedeploy-role-20240904142512929600000001]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
aws_cloudwatch_log_stream.bff_service_log_stream: Refreshing state... [id=bff-service-log-stream]
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole]
aws_cloudwatch_log_stream.redis_cache_log_stream: Refreshing state... [id=redis-log-stream]
aws_codebuild_project.build_project: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/bff-codebuild-project]
aws_iam_role_policy_attachment.codebuild_attach: Refreshing state... [id=codebuild-role-20240904142512940700000002]
aws_iam_role_policy_attachment.codepipeline_attach: Refreshing state... [id=codepipeline-role-20240904144125435300000001]
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_iam_role_policy.codepipeline_service_role_policy: Refreshing state... [id=codepipeline-role:terraform-20240904145455424300000001]
aws_cloudwatch_log_stream.gtw_service_log_stream: Refreshing state... [id=gtw-service-log-stream]
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole-20240819195525719600000001]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_lb_target_group.bff_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/0d4dcd8f3e55c5db]
aws_security_group.gtw_lb: Refreshing state... [id=sg-0ddc9f6d8fb60802e]
aws_lb_target_group.gtw_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/c69fd0aeab02a1e0]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_codepipeline.codepipeline: Refreshing state... [id=github-to-aws-pipeline]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=redis-subnet-group]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_lb.gtw_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/1504e27b1a9387be]
aws_security_group.gtw_ecs_tasks: Refreshing state... [id=sg-0f505df8b5227d2be]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_lb.bff_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/5aa868ff550d2701]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-06e777883e1f5464b]
aws_lb_listener.gtw_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/gtw-alb/1504e27b1a9387be/8e7e051be87c920e]
aws_security_group.redis_sg: Refreshing state... [id=sg-0c9a22295813f5385]
aws_elasticache_replication_group.redis: Refreshing state... [id=my-redis-cluster]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/5aa868ff550d2701/ce2ba0c83e75b924]
data.aws_elasticache_replication_group.redis_cluster: Reading...
data.aws_elasticache_replication_group.redis_cluster: Read complete after 0s [id=my-redis-cluster]
aws_ecs_task_definition.bff_service_app: Refreshing state... [id=bff-service-app-task]
aws_ecs_task_definition.gtw_service_app: Refreshing state... [id=gtw-service-app-task]
aws_ecs_service.bff_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/bff-service]
aws_ecs_service.gtw_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/gtw-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_codepipeline.codepipeline must be replaced
-/+ resource "aws_codepipeline" "codepipeline" {
      ~ arn      = "arn:aws:codepipeline:eu-west-1:802288441694:github-to-aws-pipeline" -> (known after apply)
      ~ id       = "github-to-aws-pipeline" -> (known after apply)
      ~ name     = "github-to-aws-pipeline" -> "bff-pipeline" # forces replacement
      - tags     = {} -> null
      ~ tags_all = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - artifact_store {
          - location = "my-build-artifacts-bucket-asics" -> null
          - type     = "S3" -> null
        }
      + artifact_store {
          + location = "my-build-artifacts-bucket-asics"
          + region   = (known after apply)
          + type     = "S3"
        }

      ~ stage {
            name = "Source"

          ~ action {
              - input_artifacts  = [] -> null
                name             = "Source"
              + region           = (known after apply)
              ~ run_order        = 1 -> (known after apply)
                # (6 unchanged attributes hidden)
            }
        }
      ~ stage {
            name = "Build"

          ~ action {
              ~ name             = "Build" -> "BuildBff"
              + region           = (known after apply)
              ~ run_order        = 1 -> (known after apply)
                # (7 unchanged attributes hidden)
            }
        }
    }

  # aws_iam_role_policy.codebuild_service_role_policy will be created
  + resource "aws_iam_role_policy" "codebuild_service_role_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:ListBucket",
                          + "codebuild:BatchGetBuilds",
                          + "codebuild:StartBuild",
                          + "codebuild:BatchGetProjects",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeVpcs",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "codebuild-role"
    }

  # aws_iam_role_policy.codedeploy_service_role_policy will be created
  + resource "aws_iam_role_policy" "codedeploy_service_role_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:DescribeServices",
                          + "ecs:UpdateService",
                          + "ecs:DescribeTaskDefinition",
                          + "ecs:DescribeTasks",
                          + "ecs:ListTasks",
                          + "events:PutRule",
                          + "events:PutTargets",
                          + "events:DescribeRule",
                          + "lambda:InvokeFunction",
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:GetBucketVersioning",
                          + "application-autoscaling:RegisterScalableTarget",
                          + "application-autoscaling:DeleteScalingPolicy",
                          + "application-autoscaling:DeregisterScalableTarget",
                          + "application-autoscaling:DescribeScalableTargets",
                          + "application-autoscaling:PutScalingPolicy",
                          + "application-autoscaling:DescribeScalingPolicies",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:PutMetricAlarm",
                          + "cloudwatch:DeleteAlarms",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "codedeploy-role"
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-06e777883e1f5464b"
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.gtw_ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "gtw_ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0f505df8b5227d2be"
        name                   = "gtw-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*